minhtue123/Nong_Nghiep_Thong_Minh/firmware/VisionBot_ESP32CAM_INTERNET_PUSH/VisionBot_ESP32CAM_INTERNET_PUSH.ino
/*
  VisionBot ESP32-CAM Firmware v1.0 Production-Oriented
  ------------------------------------------------------
  Features:
    - Config portal displays device_id
    - No hard-coded Wi-Fi credentials
    - MQTT control/status/telemetry
    - WebSocket camera stream on port 86
    - Dynamic IP announce via MQTT state
    - Motor watchdog / command TTL
    - State + telemetry + basic security events

  Hardware mapping inherited from current tested baseline:
    L298N IN1 -> GPIO12
    L298N IN2 -> GPIO13
    L298N IN3 -> GPIO14
    L298N IN4 -> GPIO15
    Servo signal -> GPIO2

  Required Arduino libraries:
    - WiFiManager by tzapu
    - PubSubClient by Nick O'Leary
    - WebSockets by Markus Sattler
    - ArduinoJson by Benoit Blanchon
    - esp32-camera / ESP32 board package

  Demo note:
    This build targets a portable LAN demo. Set Windows Mobile Hotspot to:
      SSID: ThinhVip
      Password: Thinh123
    Windows hotspot normally gives the laptop IP 192.168.137.1.
    ESP uses plain MQTT port 1883. Start the broker first, then backend/frontend.
*/

#include <Arduino.h>
#include <WiFi.h>
#include <WiFiClient.h>
#include <WebServer.h>
#include <WebSocketsServer.h>
#include <WebSocketsClient.h>
#include <PubSubClient.h>
#include <WiFiManager.h>
#include <Preferences.h>
#include <ArduinoJson.h>
#include <esp_camera.h>
#include <esp_system.h>
#include <time.h>

#if __has_include("esp_arduino_version.h")
#include "esp_arduino_version.h"
#endif

#ifndef ESP_ARDUINO_VERSION_MAJOR
#define ESP_ARDUINO_VERSION_MAJOR 2
#endif

// ================= FIRMWARE =================
#define FW_NAME    "visionbot-esp32cam"
#define FW_VERSION "1.3.1-esp32cam-internet-push-sds-p0"

// ================= WIFI / MQTT DEFAULTS =================
// Internet mode should use WiFiManager portal instead of a fixed laptop hotspot.
// Set VISIONBOT_DEMO_WIFI_ENABLE to 1 only for local fallback demos.
#define VISIONBOT_DEMO_WIFI_ENABLE 0
#define VISIONBOT_DEMO_WIFI_SSID "bailab"
#define VISIONBOT_DEMO_WIFI_PASS "12345678"
#define VISIONBOT_DEMO_MQTT_HOST "172.16.16.10"
#define VISIONBOT_DEMO_MQTT_PORT 1883

#define VISIONBOT_DEFAULT_MQTT_HOST "broker.emqx.io"
#define VISIONBOT_DEFAULT_MQTT_PORT 1883

// ================= INTERNET CAMERA PUSH DEFAULTS =================
// ESP32-CAM pushes frames outbound to the backend, so backend no longer needs
// to know or reach the ESP's LAN IP. For Internet use, expose backend port 8000
// with Cloudflare Tunnel/ngrok/VPS and put that host here.
#define VISIONBOT_PUSH_ENABLE 1
#define VISIONBOT_PUSH_TLS 1
#define VISIONBOT_PUSH_HOST "your-cloudflare-or-vps-domain.example.com"
#define VISIONBOT_PUSH_PORT 443
#define VISIONBOT_PUSH_BASE_PATH "/camera/ws/push"
#define VISIONBOT_PUSH_TOKEN ""
#define VISIONBOT_PUSH_INTERVAL_MS 200

// ================= CAMERA MODEL: AI THINKER =================
#define PWDN_GPIO_NUM     32
#define RESET_GPIO_NUM    -1
#define XCLK_GPIO_NUM      0
#define SIOD_GPIO_NUM     26
#define SIOC_GPIO_NUM     27

#define Y9_GPIO_NUM       35
#define Y8_GPIO_NUM       34
#define Y7_GPIO_NUM       39
#define Y6_GPIO_NUM       36
#define Y5_GPIO_NUM       21
#define Y4_GPIO_NUM       19
#define Y3_GPIO_NUM       18
#define Y2_GPIO_NUM        5
#define VSYNC_GPIO_NUM    25
#define HREF_GPIO_NUM     23
#define PCLK_GPIO_NUM     22

// ================= PIN MAPPING =================
#define IN1 12
#define IN2 13
#define IN3 14
#define IN4 15

#define SERVO_PIN 2

// ================= SERVO PWM =================
#define SERVO_CH   4
#define SERVO_FREQ 50
#define SERVO_RES  16

// ================= SERVICES =================
WebServer httpServer(80);
WebSocketsServer cameraWs = WebSocketsServer(86);
WebSocketsClient cameraPushWs;
Preferences prefs;
WiFiClient mqttNetClient;
PubSubClient mqttClient(mqttNetClient);

// ================= DEVICE CONFIG =================
struct DeviceConfig {
  String robotId;
  String baseTopic;
  String mqttHost;
  uint16_t mqttPort;
  String mqttUser;
  String mqttPass;
  String cameraPushHost;
  uint16_t cameraPushPort;
  bool cameraPushTls;
  String cameraPushToken;
  uint32_t telemetryIntervalMs;
};

DeviceConfig cfg;

// ================= DEVICE RUNTIME =================
String deviceId;
String setupApSsid;
String setupApPass;

bool cameraReady = false;
uint8_t cameraClientCount = 0;
bool cameraPushConnected = false;
unsigned long lastFrameMs = 0;
unsigned long lastPushFrameMs = 0;
const unsigned long FRAME_INTERVAL_MS = 33;  // ~30 FPS target
const uint32_t CAMERA_XCLK_HZ = 15000000;    // XCLK 15 MHz: smoother in current OV3660 test
const framesize_t CAMERA_FRAME_SIZE_PSRAM = FRAMESIZE_QVGA;    // 320x240
const framesize_t CAMERA_FRAME_SIZE_NO_PSRAM = FRAMESIZE_QQVGA; // 160x120 fallback
const int CAMERA_JPEG_QUALITY_PSRAM = 22;    // Higher number = smaller/lower quality JPEG
const int CAMERA_JPEG_QUALITY_NO_PSRAM = 26;

bool mqttEverConnected = false;
unsigned long lastMqttAttemptMs = 0;
unsigned long mqttReconnectDelayMs = 1000;
const unsigned long MQTT_RECONNECT_MAX_MS = 30000;

uint8_t mqttConsecutiveFailures = 0;
const unsigned long MQTT_OFFLINE_LOG_EVERY_MS = 30000;
unsigned long lastMqttOfflineLogMs = 0;

unsigned long wifiDisconnectedSinceMs = 0;
unsigned long lastWifiReconnectAttemptMs = 0;
unsigned long wifiReconnectDelayMs = 1000;
const unsigned long WIFI_AUTO_PORTAL_AFTER_MS = 300000;
const unsigned long WIFI_OFFLINE_LOG_EVERY_MS = 30000;
unsigned long lastWifiOfflineLogMs = 0;

unsigned long lastTelemetryMs = 0;
unsigned long lastStateMs = 0;
const unsigned long STATE_INTERVAL_MS = 30000;

unsigned long bootMs = 0;
uint32_t securityEventCount = 0;
String lastSecurityEvent = "boot";

// ================= CONTROL STATE =================
enum RobotMode {
  MODE_IDLE,
  MODE_MANUAL,
  MODE_AI,
  MODE_ESTOP
};

RobotMode currentMode = MODE_IDLE;

unsigned long lastMotorCommandMs = 0;
unsigned long currentCommandTtlMs = 500;
bool motorActive = false;
String motorState = "stop";
int servoAngle = 90;
uint32_t lastCmdSeq = 0;
String lastCmdAckStatus = "none";
String lastCmdAckDetail = "none";

