minhtue123/Nong_Nghiep_Thong_Minh/firmware/VisionBot_ESP32CAM_INTERNET_PUSH/VisionBot_ESP32CAM_INTERNET_PUSH.ino
// ================= HELPERS =================
String jsonEscape(const String &s) {
  String out = "";
  out.reserve(s.length() + 8);
  for (size_t i = 0; i < s.length(); i++) {
    char c = s[i];
    if (c == '\"') out += "\\\"";
    else if (c == '\\') out += "\\\\";
    else if (c == '\n') out += "\\n";
    else if (c == '\r') out += "\\r";
    else if (c == '\t') out += "\\t";
    else out += c;
  }
  return out;
}

void publishSecurityEvent(const String &eventType, const String &detail, const String &severity);

unsigned long nextBackoffDelayMs(unsigned long currentMs) {
  if (currentMs < 1000) return 1000;
  if (currentMs < 2000) return 2000;
  if (currentMs < 5000) return 5000;
  if (currentMs < 10000) return 10000;
  if (currentMs < 20000) return 20000;
  return 30000;
}

String q(const String &s) {
  return "\"" + jsonEscape(s) + "\"";
}

String boolStr(bool v) {
  return v ? "true" : "false";
}

String modeToString() {
  switch (currentMode) {
    case MODE_IDLE: return "idle";
    case MODE_MANUAL: return "manual";
    case MODE_AI: return "ai";
    case MODE_ESTOP: return "estop";
    default: return "unknown";
  }
}

void setModeFromString(const String &mode) {
  if (mode == "idle") currentMode = MODE_IDLE;
  else if (mode == "manual") currentMode = MODE_MANUAL;
  else if (mode == "ai") currentMode = MODE_AI;
  else if (mode == "estop") currentMode = MODE_ESTOP;
}

String resetReasonToString() {
  esp_reset_reason_t r = esp_reset_reason();
  switch (r) {
    case ESP_RST_POWERON: return "poweron";
    case ESP_RST_EXT: return "external";
    case ESP_RST_SW: return "software";
    case ESP_RST_PANIC: return "panic";
    case ESP_RST_INT_WDT: return "interrupt_watchdog";
    case ESP_RST_TASK_WDT: return "task_watchdog";
    case ESP_RST_WDT: return "other_watchdog";
    case ESP_RST_DEEPSLEEP: return "deepsleep";
    case ESP_RST_BROWNOUT: return "brownout";
    case ESP_RST_SDIO: return "sdio";
    default: return "unknown";
  }
}

String getIpString() {
  if (WiFi.status() == WL_CONNECTED) return WiFi.localIP().toString();
  return "0.0.0.0";
}

String getHttpBase() {
  return "http://" + getIpString();
}

String getStreamUrl() {
  return "ws://" + getIpString() + ":86/";
}

String mqttTopic(const String &suffix) {
  return cfg.baseTopic + "/" + deviceId + "/" + suffix;
}

long currentUnixTs() {
  time_t now;
  time(&now);
  if (now < 1700000000) return 0; // not synced
  return (long)now;
}

void generateDeviceId() {
  uint64_t mac = ESP.getEfuseMac();
  uint32_t last24 = (uint32_t)(mac & 0xFFFFFF);

  char buf[24];
  snprintf(buf, sizeof(buf), "VB-CAM-%06X", last24);
  deviceId = String(buf);

  char apBuf[32];
  snprintf(apBuf, sizeof(apBuf), "VisionBot-%06X", last24);
  setupApSsid = String(apBuf);
}

String generateRandomSetupPassword() {
  const char alphabet[] = "ABCDEFGHJKLMNPQRSTUVWXYZ23456789";
  String pass = "VB-";
  for (int i = 0; i < 10; i++) {
    uint32_t r = esp_random();
    pass += alphabet[r % (sizeof(alphabet) - 1)];
  }
  return pass;
}

void ensureSetupPassword() {
  prefs.begin("visionbot", false);
  setupApPass = prefs.getString("setup_pass", "");
  if (setupApPass.length() < 8) {
    setupApPass = generateRandomSetupPassword();
    prefs.putString("setup_pass", setupApPass);
  }
  prefs.end();
}

// ================= MOTOR =================
void motorStop() {
  digitalWrite(IN1, LOW);
  digitalWrite(IN2, LOW);
  digitalWrite(IN3, LOW);
  digitalWrite(IN4, LOW);

  motorActive = false;
  motorState = "stop";
}

void motorForward() {
  if (currentMode == MODE_ESTOP) {
    motorStop();
    return;
  }

  digitalWrite(IN1, HIGH);
  digitalWrite(IN2, LOW);
  digitalWrite(IN3, HIGH);
  digitalWrite(IN4, LOW);

  lastMotorCommandMs = millis();
  motorActive = true;
  motorState = "forward";
}

void motorBackward() {
  if (currentMode == MODE_ESTOP) {
    motorStop();
    return;
  }

  digitalWrite(IN1, LOW);
  digitalWrite(IN2, HIGH);
  digitalWrite(IN3, LOW);
  digitalWrite(IN4, HIGH);

  lastMotorCommandMs = millis();
  motorActive = true;
  motorState = "backward";
}

void motorLeft() {
  if (currentMode == MODE_ESTOP) {
    motorStop();
    return;
  }

  digitalWrite(IN1, LOW);
  digitalWrite(IN2, HIGH);
  digitalWrite(IN3, HIGH);
  digitalWrite(IN4, LOW);

  lastMotorCommandMs = millis();
  motorActive = true;
  motorState = "left";
}

void motorRight() {
  if (currentMode == MODE_ESTOP) {
    motorStop();
    return;
  }

  digitalWrite(IN1, HIGH);
  digitalWrite(IN2, LOW);
  digitalWrite(IN3, LOW);
  digitalWrite(IN4, HIGH);

  lastMotorCommandMs = millis();
  motorActive = true;
  motorState = "right";
}

void applyMotorCommand(const String &cmd, uint32_t seq = 0, unsigned long ttlMs = 700) {
  if (seq > 0) lastCmdSeq = seq;
  currentCommandTtlMs = constrain(ttlMs, 300UL, 500UL);

  if (cmd == "forward") motorForward();
  else if (cmd == "backward") motorBackward();
  else if (cmd == "left") motorLeft();
  else if (cmd == "right") motorRight();
  else motorStop();
}

void applyDifferentialDrive(float left, float right, uint32_t seq, unsigned long ttlMs) {
  if (seq > 0) lastCmdSeq = seq;
  currentCommandTtlMs = constrain(ttlMs, 300UL, 500UL);

  const float deadband = 0.08;

  if (fabs(left) < deadband && fabs(right) < deadband) {
    motorStop();
    return;
  }

  // This v1 firmware assumes L298N ENA/ENB jumpers are installed.
  // Therefore left/right speed is converted into direction only.
  // For true proportional speed, wire ENA/ENB to PWM-capable GPIO pins.
  if (left > deadband && right > deadband) {
    motorForward();
  } else if (left < -deadband && right < -deadband) {
    motorBackward();
  } else if (left < right) {
    motorLeft();
  } else if (left > right) {
    motorRight();
  } else {
    motorStop();
  }
}

// ================= SERVO =================
void setupServoPwm() {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(SERVO_PIN, SERVO_FREQ, SERVO_RES);
#else
  ledcSetup(SERVO_CH, SERVO_FREQ, SERVO_RES);
  ledcAttachPin(SERVO_PIN, SERVO_CH);
#endif
}

void servoWriteAngle(int angle) {
  angle = constrain(angle, 0, 180);
  servoAngle = angle;

  const int minUs = 500;
  const int maxUs = 2500;
  int pulseUs = map(angle, 0, 180, minUs, maxUs);

  uint32_t maxDuty = (1UL << SERVO_RES) - 1;
  uint32_t duty = (uint32_t)((pulseUs / 20000.0) * maxDuty);

