minhtue123/Nong_Nghiep_Thong_Minh/firmware/VisionBot_ESP32CAM_INTERNET_PUSH/VisionBot_ESP32CAM_INTERNET_PUSH.ino
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(SERVO_PIN, duty);
#else
  ledcWrite(SERVO_CH, duty);
#endif
}

// ================= CONFIG =================
void loadDeviceConfig() {
  prefs.begin("visionbot", true);

  cfg.robotId = prefs.getString("robot_id", deviceId);
  if (cfg.robotId.length() == 0) cfg.robotId = deviceId;

  cfg.baseTopic = prefs.getString("base_topic", "visionbot");
  cfg.mqttHost = prefs.getString("mqtt_host", VISIONBOT_DEFAULT_MQTT_HOST);
  cfg.mqttPort = prefs.getUShort("mqtt_port", VISIONBOT_DEFAULT_MQTT_PORT);
  cfg.mqttUser = prefs.getString("mqtt_user", "");
  cfg.mqttPass = prefs.getString("mqtt_pass", "");
  cfg.cameraPushHost = prefs.getString("push_host", VISIONBOT_PUSH_HOST);
  cfg.cameraPushPort = prefs.getUShort("push_port", VISIONBOT_PUSH_PORT);
  cfg.cameraPushTls = prefs.getBool("push_tls", VISIONBOT_PUSH_TLS != 0);
  cfg.cameraPushToken = prefs.getString("push_token", VISIONBOT_PUSH_TOKEN);
  cfg.telemetryIntervalMs = prefs.getUInt("telemetry_ms", 5000);

  prefs.end();

#if VISIONBOT_DEMO_WIFI_ENABLE
  cfg.baseTopic = "visionbot";
  cfg.mqttHost = VISIONBOT_DEMO_MQTT_HOST;
  cfg.mqttPort = VISIONBOT_DEMO_MQTT_PORT;
  cfg.mqttUser = "";
  cfg.mqttPass = "";
#endif

  cfg.telemetryIntervalMs = constrain(cfg.telemetryIntervalMs, 1000UL, 60000UL);
  if (cfg.cameraPushPort == 0) cfg.cameraPushPort = VISIONBOT_PUSH_PORT;
}

void saveDeviceConfig(
  const char *robotId,
  const char *baseTopic,
  const char *mqttHost,
  const char *mqttPort,
  const char *mqttUser,
  const char *mqttPass,
  const char *pushHost,
  const char *pushPort,
  const char *pushTls,
  const char *pushToken,
  const char *telemetryMs
) {
  prefs.begin("visionbot", false);

  prefs.putString("robot_id", String(robotId));
  prefs.putString("base_topic", String(baseTopic));
  prefs.putString("mqtt_host", String(mqttHost));
  prefs.putUShort("mqtt_port", (uint16_t)atoi(mqttPort));
  prefs.putString("mqtt_user", String(mqttUser));
  prefs.putString("mqtt_pass", String(mqttPass));
  prefs.putString("push_host", String(pushHost));
  prefs.putUShort("push_port", (uint16_t)atoi(pushPort));
  prefs.putBool("push_tls", String(pushTls) == "1" || String(pushTls) == "true" || String(pushTls) == "yes");
  prefs.putString("push_token", String(pushToken));
  prefs.putUInt("telemetry_ms", (uint32_t)atol(telemetryMs));

  prefs.end();

  loadDeviceConfig();
}

void resetAllConfigAndRestart() {
  motorStop();

  prefs.begin("visionbot", false);
  prefs.clear();
  prefs.end();

  WiFi.disconnect(true, true);

  delay(500);
  ESP.restart();
}

String getRecoveryPortalReason() {
  prefs.begin("visionbot", true);
  String reason = prefs.getString("portal_reason", "");
  prefs.end();
  return reason;
}

void setRecoveryPortalReason(const String &reason) {
  prefs.begin("visionbot", false);
  prefs.putString("portal_reason", reason);
  prefs.end();
}

void clearRecoveryPortalReason() {
  prefs.begin("visionbot", false);
  prefs.remove("portal_reason");
  prefs.end();
}

bool runConfigPortal(bool forcePortal, const String &reason) {
  loadDeviceConfig();

  char robotIdBuf[40];
  char baseTopicBuf[32];
  char mqttHostBuf[80];
  char mqttPortBuf[8];
  char mqttUserBuf[80];
  char mqttPassBuf[80];
  char pushHostBuf[100];
  char pushPortBuf[8];
  char pushTlsBuf[8];
  char pushTokenBuf[96];
  char telemetryMsBuf[12];

  strlcpy(robotIdBuf, cfg.robotId.c_str(), sizeof(robotIdBuf));
  strlcpy(baseTopicBuf, cfg.baseTopic.c_str(), sizeof(baseTopicBuf));
  strlcpy(mqttHostBuf, cfg.mqttHost.c_str(), sizeof(mqttHostBuf));
  snprintf(mqttPortBuf, sizeof(mqttPortBuf), "%u", cfg.mqttPort);
  strlcpy(mqttUserBuf, cfg.mqttUser.c_str(), sizeof(mqttUserBuf));
  strlcpy(mqttPassBuf, cfg.mqttPass.c_str(), sizeof(mqttPassBuf));
  strlcpy(pushHostBuf, cfg.cameraPushHost.c_str(), sizeof(pushHostBuf));
  snprintf(pushPortBuf, sizeof(pushPortBuf), "%u", cfg.cameraPushPort);
  strlcpy(pushTlsBuf, cfg.cameraPushTls ? "1" : "0", sizeof(pushTlsBuf));
  strlcpy(pushTokenBuf, cfg.cameraPushToken.c_str(), sizeof(pushTokenBuf));
  snprintf(telemetryMsBuf, sizeof(telemetryMsBuf), "%lu", (unsigned long)cfg.telemetryIntervalMs);

  String deviceHtml =
    "<div style='padding:10px;border:1px solid #ccc;border-radius:8px;margin:8px 0;'>"
    "<b>VisionBot ESP32-CAM</b><br>"
    "Device ID: <b>" + deviceId + "</b><br>"
    "Setup AP: <b>" + setupApSsid + "</b><br>"
    "Firmware: <b>" + String(FW_VERSION) + "</b><br>"
    "Reason: <b>" + reason + "</b><br>"
    "Camera stream after Wi-Fi: <b>ws://&lt;device_ip&gt;:86/</b><br>"
    "MQTT: <b>plain MQTT 1883 or cloud broker</b><br>"
    "Camera push: <b>wss://relay-domain/camera/ws/push/" + deviceId + "</b>"
    "</div>";

  WiFiManagerParameter pDevice(deviceHtml.c_str());
  WiFiManagerParameter pRobotId("robot_id", "Robot ID / friendly name", robotIdBuf, sizeof(robotIdBuf));
  WiFiManagerParameter pBaseTopic("base_topic", "MQTT base topic", baseTopicBuf, sizeof(baseTopicBuf));
  WiFiManagerParameter pMqttHost("mqtt_host", "MQTT broker host/IP", mqttHostBuf, sizeof(mqttHostBuf));
  WiFiManagerParameter pMqttPort("mqtt_port", "MQTT broker port", mqttPortBuf, sizeof(mqttPortBuf));
  WiFiManagerParameter pMqttUser("mqtt_user", "MQTT username", mqttUserBuf, sizeof(mqttUserBuf));
  WiFiManagerParameter pMqttPass("mqtt_pass", "MQTT password", mqttPassBuf, sizeof(mqttPassBuf), "type='password'");
  WiFiManagerParameter pPushHost("push_host", "Camera relay host/domain", pushHostBuf, sizeof(pushHostBuf));
  WiFiManagerParameter pPushPort("push_port", "Camera relay port", pushPortBuf, sizeof(pushPortBuf));
  WiFiManagerParameter pPushTls("push_tls", "Camera relay TLS 1=yes 0=no", pushTlsBuf, sizeof(pushTlsBuf));
  WiFiManagerParameter pPushToken("push_token", "Camera relay token", pushTokenBuf, sizeof(pushTokenBuf), "type='password'");
  WiFiManagerParameter pTelemetryMs("telemetry_ms", "Telemetry interval ms", telemetryMsBuf, sizeof(telemetryMsBuf));

  WiFiManager wm;
  wm.setTitle("VisionBot Setup");
  wm.setClass("invert");
  wm.setConfigPortalTimeout(300);
  wm.setConnectTimeout(30);
  wm.setDebugOutput(true);

