minhtue123/Nong_Nghiep_Thong_Minh/firmware/VisionBot_ESP32CAM_INTERNET_PUSH/VisionBot_ESP32CAM_INTERNET_PUSH.ino
  wm.addParameter(&pDevice);
  wm.addParameter(&pRobotId);
  wm.addParameter(&pBaseTopic);
  wm.addParameter(&pMqttHost);
  wm.addParameter(&pMqttPort);
  wm.addParameter(&pMqttUser);
  wm.addParameter(&pMqttPass);
  wm.addParameter(&pPushHost);
  wm.addParameter(&pPushPort);
  wm.addParameter(&pPushTls);
  wm.addParameter(&pPushToken);
  wm.addParameter(&pTelemetryMs);

  Serial.println();
  Serial.println("=== Wi-Fi / MQTT setup portal ===");
  Serial.print("Reason: ");
  Serial.println(reason);
  Serial.print("Mode: ");
  Serial.println(forcePortal ? "FORCED CONFIG PORTAL" : "AUTO CONNECT / PORTAL IF WI-FI FAILS");
  Serial.print("Device ID: ");
  Serial.println(deviceId);
  Serial.print("Setup AP SSID: ");
  Serial.println(setupApSsid);
  Serial.print("Setup AP password: ");
  Serial.println(setupApPass);
  Serial.print("Current MQTT host: ");
  Serial.println(cfg.mqttHost);
  Serial.println("If saved Wi-Fi fails, config portal opens automatically.");
  Serial.println("MQTT failures will NOT force portal/restart; robot keeps camera/HTTP alive and retries.");

  bool connected;
  if (forcePortal) {
    motorStop();
    mqttClient.disconnect();
    connected = wm.startConfigPortal(setupApSsid.c_str(), setupApPass.c_str());
  } else {
    connected = wm.autoConnect(setupApSsid.c_str(), setupApPass.c_str());
  }

  if (!connected) {
    Serial.println("WiFiManager failed or timed out. Restarting...");
    delay(1000);
    ESP.restart();
    return false;
  }

  saveDeviceConfig(
    pRobotId.getValue(),
    pBaseTopic.getValue(),
    pMqttHost.getValue(),
    pMqttPort.getValue(),
    pMqttUser.getValue(),
    pMqttPass.getValue(),
    pPushHost.getValue(),
    pPushPort.getValue(),
    pPushTls.getValue(),
    pPushToken.getValue(),
    pTelemetryMs.getValue()
  );

  if (forcePortal) {
    clearRecoveryPortalReason();
  }

  WiFi.setSleep(false);
  Serial.println("Wi-Fi connected.");
  Serial.println("Wi-Fi sleep disabled for lower camera-stream latency.");
  Serial.print("IP: ");
  Serial.println(WiFi.localIP());

  if (forcePortal) {
    Serial.println("Config portal finished. Restarting to reload Wi-Fi/MQTT cleanly...");
    delay(1000);
    ESP.restart();
  }

  return true;
}

bool connectDemoHotspot() {
#if VISIONBOT_DEMO_WIFI_ENABLE
  Serial.println();
  Serial.println("=== Hardcoded laptop hotspot Wi-Fi ===");
  Serial.print("Trying SSID: ");
  Serial.println(VISIONBOT_DEMO_WIFI_SSID);
  Serial.print("MQTT broker default: ");
  Serial.print(VISIONBOT_DEMO_MQTT_HOST);
  Serial.print(":");
  Serial.println(VISIONBOT_DEMO_MQTT_PORT);

  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.begin(VISIONBOT_DEMO_WIFI_SSID, VISIONBOT_DEMO_WIFI_PASS);

  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < 45000) {
    Serial.print(".");
    delay(500);
  }
  Serial.println();

  if (WiFi.status() == WL_CONNECTED) {
    loadDeviceConfig();
    Serial.println("Hardcoded hotspot connected.");
    Serial.println("Wi-Fi sleep disabled for lower camera-stream latency.");
    Serial.print("IP: ");
    Serial.println(WiFi.localIP());
    return true;
  }

  Serial.println("Hardcoded hotspot not found. Falling back to setup portal.");
#endif
  return false;
}

bool startConfigPortalIfNeeded() {
  String recoveryReason = getRecoveryPortalReason();
  if (recoveryReason.length() > 0) {
    if (recoveryReason.indexOf("mqtt_connect_failed") >= 0 || recoveryReason == "wifi_disconnected") {
      Serial.println("Ignoring old service recovery portal reason; runtime reconnect now retries without forcing portal.");
      clearRecoveryPortalReason();
      recoveryReason = "";
    } else {
      return runConfigPortal(true, recoveryReason);
    }
  }
  if (connectDemoHotspot()) {
    return true;
  }
  return runConfigPortal(false, "boot");
}

void openConfigPortalForRecovery(const String &reason) {
  Serial.println();
  Serial.println("!!! Scheduling recovery config portal !!!");
  Serial.println("Reason: " + reason);
  Serial.println("Restarting into clean setup mode so WiFiManager can own port 80.");
  setRecoveryPortalReason(reason);
  motorStop();
  mqttClient.disconnect();
  delay(1000);
  ESP.restart();
}

void resetMqttFailureTracker() {
  mqttConsecutiveFailures = 0;
}

void recordMqttFailureAndKeepRunning() {
  mqttConsecutiveFailures++;

  unsigned long now = millis();
  if (mqttConsecutiveFailures <= 3 || now - lastMqttOfflineLogMs >= MQTT_OFFLINE_LOG_EVERY_MS) {
    lastMqttOfflineLogMs = now;
    Serial.print("MQTT offline, retrying in background. Consecutive failures: ");
    Serial.println(mqttConsecutiveFailures);
    Serial.println("Robot stays online. Camera/HTTP still work; update MQTT host if this Wi-Fi is not laptop hotspot 192.168.137.x.");
  }
}

void maintainWifiRecoveryPortal() {
  if (WiFi.status() == WL_CONNECTED) {
    wifiDisconnectedSinceMs = 0;
    wifiReconnectDelayMs = 1000;
    return;
  }

  if (motorActive) {
    motorStop();
  }

  unsigned long now = millis();
  if (wifiDisconnectedSinceMs == 0) {
    wifiDisconnectedSinceMs = now;
    lastWifiReconnectAttemptMs = 0;
    Serial.println("Wi-Fi disconnected. State=WIFI_RETRY_WAIT. Retrying without reset/AP loop.");
    return;
  }

  if (lastWifiReconnectAttemptMs == 0 || now - lastWifiReconnectAttemptMs >= wifiReconnectDelayMs) {
    lastWifiReconnectAttemptMs = now;
    Serial.print("Wi-Fi reconnect attempt; next backoff was ");
    Serial.print(wifiReconnectDelayMs);
    Serial.println(" ms");
    WiFi.reconnect();
    wifiReconnectDelayMs = nextBackoffDelayMs(wifiReconnectDelayMs);
  }

  if (now - wifiDisconnectedSinceMs >= WIFI_AUTO_PORTAL_AFTER_MS && now - lastWifiOfflineLogMs >= WIFI_OFFLINE_LOG_EVERY_MS) {
    lastWifiOfflineLogMs = now;
    Serial.println("Wi-Fi still offline. Keeping retry loop; not opening AP automatically while runtime services are active.");
  }
}

// ================= CAMERA =================
bool initCamera() {
  camera_config_t config;

  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer   = LEDC_TIMER_0;

