minhtue123/Nong_Nghiep_Thong_Minh/firmware/VisionBot_ESP32CAM_INTERNET_PUSH/VisionBot_ESP32CAM_INTERNET_PUSH.ino
  config.pin_d0       = Y2_GPIO_NUM;
  config.pin_d1       = Y3_GPIO_NUM;
  config.pin_d2       = Y4_GPIO_NUM;
  config.pin_d3       = Y5_GPIO_NUM;
  config.pin_d4       = Y6_GPIO_NUM;
  config.pin_d5       = Y7_GPIO_NUM;
  config.pin_d6       = Y8_GPIO_NUM;
  config.pin_d7       = Y9_GPIO_NUM;

  config.pin_xclk     = XCLK_GPIO_NUM;
  config.pin_pclk     = PCLK_GPIO_NUM;
  config.pin_vsync    = VSYNC_GPIO_NUM;
  config.pin_href     = HREF_GPIO_NUM;

#if ESP_ARDUINO_VERSION_MAJOR >= 3
  config.pin_sccb_sda = SIOD_GPIO_NUM;
  config.pin_sccb_scl = SIOC_GPIO_NUM;
#else
  config.pin_sscb_sda = SIOD_GPIO_NUM;
  config.pin_sscb_scl = SIOC_GPIO_NUM;
#endif

  config.pin_pwdn     = PWDN_GPIO_NUM;
  config.pin_reset    = RESET_GPIO_NUM;

  config.xclk_freq_hz = CAMERA_XCLK_HZ;
  config.pixel_format = PIXFORMAT_JPEG;

  if (psramFound()) {
    config.frame_size   = CAMERA_FRAME_SIZE_PSRAM;
    config.jpeg_quality = CAMERA_JPEG_QUALITY_PSRAM;
    config.fb_count     = 2;
  } else {
    config.frame_size   = CAMERA_FRAME_SIZE_NO_PSRAM;
    config.jpeg_quality = CAMERA_JPEG_QUALITY_NO_PSRAM;
    config.fb_count     = 1;
  }

  esp_err_t err = esp_camera_init(&config);

  if (err != ESP_OK) {
    Serial.printf("Camera init failed: 0x%x\n", err);
    return false;
  }

  sensor_t *s = esp_camera_sensor_get();
  if (s) {
    framesize_t frameSize = psramFound() ? CAMERA_FRAME_SIZE_PSRAM : CAMERA_FRAME_SIZE_NO_PSRAM;
    int jpegQuality = psramFound() ? CAMERA_JPEG_QUALITY_PSRAM : CAMERA_JPEG_QUALITY_NO_PSRAM;

    if (s->set_framesize) s->set_framesize(s, frameSize);
    if (s->set_quality) s->set_quality(s, jpegQuality);

    // Fixed low-latency camera profile. Keep it simple: no runtime camera tuning yet.
    if (s->set_brightness) s->set_brightness(s, 0);
    if (s->set_contrast) s->set_contrast(s, 0);
    if (s->set_saturation) s->set_saturation(s, -2);
    if (s->set_whitebal) s->set_whitebal(s, 1);
    if (s->set_exposure_ctrl) s->set_exposure_ctrl(s, 1);
    if (s->set_gain_ctrl) s->set_gain_ctrl(s, 1);
    if (s->set_raw_gma) s->set_raw_gma(s, 1);
    if (s->set_lenc) s->set_lenc(s, 1);
    if (s->set_bpc) s->set_bpc(s, 1);
    if (s->set_wpc) s->set_wpc(s, 1);
    if (s->set_hmirror) s->set_hmirror(s, 1);
    if (s->set_vflip) s->set_vflip(s, 1);
    if (s->set_colorbar) s->set_colorbar(s, 0);
  }

  Serial.println("Camera init OK.");
  Serial.printf("Camera profile: XCLK=%lu Hz, frame_interval=%lu ms, frame_size=%s, jpeg_quality=%d\n",
                (unsigned long)CAMERA_XCLK_HZ,
                FRAME_INTERVAL_MS,
                psramFound() ? "QVGA" : "QQVGA",
                psramFound() ? CAMERA_JPEG_QUALITY_PSRAM : CAMERA_JPEG_QUALITY_NO_PSRAM);
  return true;
}

void cameraWsEvent(uint8_t num, WStype_t type, uint8_t *payload, size_t length) {
  switch (type) {
    case WStype_CONNECTED:
      cameraClientCount++;
      Serial.printf("[CAM WS] client %u connected. clients=%u\n", num, cameraClientCount);
      lastSecurityEvent = "camera_ws_connected";
      break;

    case WStype_DISCONNECTED:
      if (cameraClientCount > 0) cameraClientCount--;
      Serial.printf("[CAM WS] client %u disconnected. clients=%u\n", num, cameraClientCount);
      lastSecurityEvent = "camera_ws_disconnected";
      break;

    default:
      break;
  }
}

void cameraPushEvent(WStype_t type, uint8_t *payload, size_t length) {
  switch (type) {
    case WStype_CONNECTED:
      cameraPushConnected = true;
      Serial.println("[CAM PUSH] connected to backend relay.");
      publishSecurityEvent("camera_push_connected", "backend relay connected", "info");
      break;

    case WStype_DISCONNECTED:
      cameraPushConnected = false;
      Serial.println("[CAM PUSH] disconnected from backend relay.");
      break;

    case WStype_ERROR:
      cameraPushConnected = false;
      Serial.println("[CAM PUSH] websocket error.");
      break;

    default:
      break;
  }
}

void setupCameraPushClient() {
#if VISIONBOT_PUSH_ENABLE
  if (cfg.cameraPushHost.length() == 0) {
    Serial.println("[CAM PUSH] disabled: empty backend host.");
    return;
  }

  String path = String(VISIONBOT_PUSH_BASE_PATH) + "/" + deviceId;
  if (cfg.cameraPushToken.length() > 0) {
    path += "?token=";
    path += cfg.cameraPushToken;
  }
  Serial.print("[CAM PUSH] relay URL: ");
  Serial.print(cfg.cameraPushTls ? "wss://" : "ws://");
  Serial.print(cfg.cameraPushHost);
  Serial.print(":");
  Serial.print(cfg.cameraPushPort);
  Serial.println(path);

  cameraPushWs.onEvent(cameraPushEvent);
  cameraPushWs.setReconnectInterval(5000);
  cameraPushWs.enableHeartbeat(15000, 3000, 2);
  if (cfg.cameraPushTls) {
    cameraPushWs.beginSSL(cfg.cameraPushHost.c_str(), cfg.cameraPushPort, path.c_str());
  } else {
    cameraPushWs.begin(cfg.cameraPushHost.c_str(), cfg.cameraPushPort, path.c_str());
  }
#endif
}

void pushCameraFrame() {
#if VISIONBOT_PUSH_ENABLE
  if (!cameraReady || !cameraPushConnected) return;

  unsigned long now = millis();
  if (now - lastPushFrameMs < VISIONBOT_PUSH_INTERVAL_MS) return;
  lastPushFrameMs = now;

  camera_fb_t *fb = esp_camera_fb_get();
  if (!fb) {
    Serial.println("[CAM PUSH] camera capture failed");
    return;
  }

  if (fb->format == PIXFORMAT_JPEG) {
    cameraPushWs.sendBIN(fb->buf, fb->len);
  }

  esp_camera_fb_return(fb);
#endif
}

void streamCameraFrame() {
  if (!cameraReady) return;
  if (cameraClientCount == 0) return;

  unsigned long now = millis();
  if (now - lastFrameMs < FRAME_INTERVAL_MS) return;
  lastFrameMs = now;

  camera_fb_t *fb = esp_camera_fb_get();
  if (!fb) {
    Serial.println("Camera capture failed");
    return;
  }

  if (fb->format == PIXFORMAT_JPEG) {
    cameraWs.broadcastBIN(fb->buf, fb->len);
  }

  esp_camera_fb_return(fb);
}

// ================= JSON PAYLOADS =================
String makeStatePayload(bool online) {
  String p = "{";
  p += "\"schema\":\"visionbot.state.v1\",";
  p += "\"device_id\":" + q(deviceId) + ",";
  p += "\"robot_id\":" + q(cfg.robotId) + ",";
  p += "\"type\":\"esp32cam_robot\",";
  p += "\"online\":" + boolStr(online) + ",";
  p += "\"ts\":" + String(currentUnixTs()) + ",";
  p += "\"uptime_ms\":" + String(millis()) + ",";
  p += "\"firmware\":" + q(String(FW_NAME) + "-" + FW_VERSION) + ",";
  p += "\"ip\":" + q(getIpString()) + ",";
  p += "\"http_base\":" + q(getHttpBase()) + ",";
  p += "\"stream_url\":" + q(getStreamUrl()) + ",";
  p += "\"wifi_ssid\":" + q(WiFi.SSID()) + ",";
  p += "\"wifi_rssi_dbm\":" + String(WiFi.RSSI()) + ",";
  p += "\"mqtt_connected\":" + boolStr(mqttClient.connected()) + ",";
  p += "\"camera_ready\":" + boolStr(cameraReady) + ",";
  p += "\"camera_clients\":" + String(cameraClientCount) + ",";
  p += "\"camera_xclk_hz\":" + String(CAMERA_XCLK_HZ) + ",";
  p += "\"camera_frame_interval_ms\":" + String(FRAME_INTERVAL_MS) + ",";
  p += "\"camera_frame_size\":" + q(psramFound() ? String("QVGA") : String("QQVGA")) + ",";
  p += "\"camera_jpeg_quality\":" + String(psramFound() ? CAMERA_JPEG_QUALITY_PSRAM : CAMERA_JPEG_QUALITY_NO_PSRAM) + ",";
  p += "\"mode\":" + q(modeToString()) + ",";
  p += "\"motor_state\":" + q(motorState) + ",";
  p += "\"servo_angle\":" + String(servoAngle) + ",";
  p += "\"last_cmd_seq\":" + String(lastCmdSeq) + ",";
  p += "\"last_cmd_ack_status\":" + q(lastCmdAckStatus) + ",";
  p += "\"last_cmd_ack_detail\":" + q(lastCmdAckDetail) + ",";
  p += "\"free_heap_bytes\":" + String(ESP.getFreeHeap()) + ",";
  p += "\"min_free_heap_bytes\":" + String(ESP.getMinFreeHeap()) + ",";
  p += "\"free_psram_bytes\":" + String(ESP.getFreePsram()) + ",";
  p += "\"reset_reason\":" + q(resetReasonToString()) + ",";
  p += "\"mqtt_plain\":" + boolStr(true) + ",";
  p += "\"last_security_event\":" + q(lastSecurityEvent);
  p += "}";
  return p;
}

String makeTelemetryPayload() {
  unsigned long lastCmdAge = motorActive ? (millis() - lastMotorCommandMs) : 0;

  String p = "{";
  p += "\"schema\":\"visionbot.telemetry.v1\",";
  p += "\"device_id\":" + q(deviceId) + ",";
  p += "\"robot_id\":" + q(cfg.robotId) + ",";
  p += "\"ts\":" + String(currentUnixTs()) + ",";
  p += "\"uptime_ms\":" + String(millis()) + ",";
  p += "\"network\":{";
  p += "\"wifi_connected\":" + boolStr(WiFi.status() == WL_CONNECTED) + ",";
  p += "\"ip\":" + q(getIpString()) + ",";
  p += "\"rssi_dbm\":" + String(WiFi.RSSI()) + ",";
  p += "\"mqtt_connected\":" + boolStr(mqttClient.connected());
  p += "},";
  p += "\"camera\":{";
  p += "\"ready\":" + boolStr(cameraReady) + ",";
  p += "\"clients\":" + String(cameraClientCount) + ",";
  p += "\"stream_url\":" + q(getStreamUrl()) + ",";
  p += "\"xclk_hz\":" + String(CAMERA_XCLK_HZ) + ",";
  p += "\"frame_size\":" + q(psramFound() ? String("QVGA") : String("QQVGA")) + ",";
  p += "\"jpeg_quality\":" + String(psramFound() ? CAMERA_JPEG_QUALITY_PSRAM : CAMERA_JPEG_QUALITY_NO_PSRAM) + ",";
  p += "\"frame_interval_ms\":" + String(FRAME_INTERVAL_MS);
  p += "},";
  p += "\"control\":{";
  p += "\"mode\":" + q(modeToString()) + ",";
  p += "\"motor_state\":" + q(motorState) + ",";
  p += "\"motor_active\":" + boolStr(motorActive) + ",";
  p += "\"last_cmd_seq\":" + String(lastCmdSeq) + ",";
  p += "\"last_cmd_ack_status\":" + q(lastCmdAckStatus) + ",";
  p += "\"last_cmd_ack_detail\":" + q(lastCmdAckDetail) + ",";
  p += "\"last_cmd_age_ms\":" + String(lastCmdAge) + ",";
  p += "\"cmd_ttl_ms\":" + String(currentCommandTtlMs) + ",";
  p += "\"servo_angle\":" + String(servoAngle);
  p += "},";
  p += "\"system\":{";
  p += "\"free_heap_bytes\":" + String(ESP.getFreeHeap()) + ",";
  p += "\"min_free_heap_bytes\":" + String(ESP.getMinFreeHeap()) + ",";
  p += "\"free_psram_bytes\":" + String(ESP.getFreePsram()) + ",";
  p += "\"reset_reason\":" + q(resetReasonToString());
  p += "},";
  p += "\"security\":{";
  p += "\"mqtt_plain\":" + boolStr(true) + ",";
  p += "\"event_count\":" + String(securityEventCount) + ",";
  p += "\"last_event\":" + q(lastSecurityEvent);
  p += "}";
  p += "}";
  return p;
}

// ================= MQTT =================
void publishSecurityEvent(const String &eventType, const String &detail, const String &severity = "info") {
  lastSecurityEvent = eventType;
  securityEventCount++;

  if (!mqttClient.connected()) return;

  String p = "{";
  p += "\"schema\":\"visionbot.event.v1\",";
  p += "\"device_id\":" + q(deviceId) + ",";
  p += "\"robot_id\":" + q(cfg.robotId) + ",";
  p += "\"ts\":" + String(currentUnixTs()) + ",";
  p += "\"uptime_ms\":" + String(millis()) + ",";
  p += "\"severity\":" + q(severity) + ",";
  p += "\"type\":" + q(eventType) + ",";
  p += "\"detail\":" + q(detail);
  p += "}";

  mqttClient.publish(mqttTopic("event").c_str(), p.c_str(), false);
}

